grevaillot/svd_tools/headers/STM32G441xx/pwr.h
/** @defgroup pwr_scr SCR Power status clear register
@{*/

/** PWR_SCR_CSBF Clear standby flag **/
#define PWR_SCR_CSBF		(1 << 8)
/** PWR_SCR_CWUF5 Clear wakeup flag 5 **/
#define PWR_SCR_CWUF5		(1 << 4)
/** PWR_SCR_CWUF4 Clear wakeup flag 4 **/
#define PWR_SCR_CWUF4		(1 << 3)
/** PWR_SCR_CWUF3 Clear wakeup flag 3 **/
#define PWR_SCR_CWUF3		(1 << 2)
/** PWR_SCR_CWUF2 Clear wakeup flag 2 **/
#define PWR_SCR_CWUF2		(1 << 1)
/** PWR_SCR_CWUF1 Clear wakeup flag 1 **/
#define PWR_SCR_CWUF1		(1 << 0)

/**@}*/

/** @defgroup pwr_pucra PUCRA Power Port A pull-up control register
@{*/

/** PWR_PUCRA_PU15 Port A pull-up bit y (y=0..15) **/
#define PWR_PUCRA_PU15		(1 << 15)
/** PWR_PUCRA_PU13 Port A pull-up bit y (y=0..15) **/
#define PWR_PUCRA_PU13		(1 << 13)
/** PWR_PUCRA_PU12 Port A pull-up bit y (y=0..15) **/
#define PWR_PUCRA_PU12		(1 << 12)
/** PWR_PUCRA_PU11 Port A pull-up bit y (y=0..15) **/
#define PWR_PUCRA_PU11		(1 << 11)
/** PWR_PUCRA_PU10 Port A pull-up bit y (y=0..15) **/
#define PWR_PUCRA_PU10		(1 << 10)
/** PWR_PUCRA_PU9 Port A pull-up bit y (y=0..15) **/
#define PWR_PUCRA_PU9		(1 << 9)
/** PWR_PUCRA_PU8 Port A pull-up bit y (y=0..15) **/
#define PWR_PUCRA_PU8		(1 << 8)
/** PWR_PUCRA_PU7 Port A pull-up bit y (y=0..15) **/
#define PWR_PUCRA_PU7		(1 << 7)
/** PWR_PUCRA_PU6 Port A pull-up bit y (y=0..15) **/
#define PWR_PUCRA_PU6		(1 << 6)
/** PWR_PUCRA_PU5 Port A pull-up bit y (y=0..15) **/
#define PWR_PUCRA_PU5		(1 << 5)
/** PWR_PUCRA_PU4 Port A pull-up bit y (y=0..15) **/
#define PWR_PUCRA_PU4		(1 << 4)
/** PWR_PUCRA_PU3 Port A pull-up bit y (y=0..15) **/
#define PWR_PUCRA_PU3		(1 << 3)
/** PWR_PUCRA_PU2 Port A pull-up bit y (y=0..15) **/
#define PWR_PUCRA_PU2		(1 << 2)
/** PWR_PUCRA_PU1 Port A pull-up bit y (y=0..15) **/
#define PWR_PUCRA_PU1		(1 << 1)
/** PWR_PUCRA_PU0 Port A pull-up bit y (y=0..15) **/
#define PWR_PUCRA_PU0		(1 << 0)

/**@}*/

/** @defgroup pwr_pdcra PDCRA Power Port A pull-down control register
@{*/

/** PWR_PDCRA_PD14 Port A pull-down bit y (y=0..15) **/
#define PWR_PDCRA_PD14		(1 << 14)
/** PWR_PDCRA_PD12 Port A pull-down bit y (y=0..15) **/
#define PWR_PDCRA_PD12		(1 << 12)
/** PWR_PDCRA_PD11 Port A pull-down bit y (y=0..15) **/
#define PWR_PDCRA_PD11		(1 << 11)
/** PWR_PDCRA_PD10 Port A pull-down bit y (y=0..15) **/
#define PWR_PDCRA_PD10		(1 << 10)
/** PWR_PDCRA_PD9 Port A pull-down bit y (y=0..15) **/
#define PWR_PDCRA_PD9		(1 << 9)
/** PWR_PDCRA_PD8 Port A pull-down bit y (y=0..15) **/
#define PWR_PDCRA_PD8		(1 << 8)
/** PWR_PDCRA_PD7 Port A pull-down bit y (y=0..15) **/
#define PWR_PDCRA_PD7		(1 << 7)
/** PWR_PDCRA_PD6 Port A pull-down bit y (y=0..15) **/
#define PWR_PDCRA_PD6		(1 << 6)
/** PWR_PDCRA_PD5 Port A pull-down bit y (y=0..15) **/
#define PWR_PDCRA_PD5		(1 << 5)
/** PWR_PDCRA_PD4 Port A pull-down bit y (y=0..15) **/
#define PWR_PDCRA_PD4		(1 << 4)
/** PWR_PDCRA_PD3 Port A pull-down bit y (y=0..15) **/
#define PWR_PDCRA_PD3		(1 << 3)
/** PWR_PDCRA_PD2 Port A pull-down bit y (y=0..15) **/
#define PWR_PDCRA_PD2		(1 << 2)
/** PWR_PDCRA_PD1 Port A pull-down bit y (y=0..15) **/
#define PWR_PDCRA_PD1		(1 << 1)
/** PWR_PDCRA_PD0 Port A pull-down bit y (y=0..15) **/
#define PWR_PDCRA_PD0		(1 << 0)

/**@}*/

/** @defgroup pwr_pucrb PUCRB Power Port B pull-up control register
@{*/

/** PWR_PUCRB_PU15 Port B pull-up bit y (y=0..15) **/
#define PWR_PUCRB_PU15		(1 << 15)
/** PWR_PUCRB_PU14 Port B pull-up bit y (y=0..15) **/
#define PWR_PUCRB_PU14		(1 << 14)
/** PWR_PUCRB_PU13 Port B pull-up bit y (y=0..15) **/
#define PWR_PUCRB_PU13		(1 << 13)
/** PWR_PUCRB_PU12 Port B pull-up bit y (y=0..15) **/
#define PWR_PUCRB_PU12		(1 << 12)
/** PWR_PUCRB_PU11 Port B pull-up bit y (y=0..15) **/
#define PWR_PUCRB_PU11		(1 << 11)
/** PWR_PUCRB_PU10 Port B pull-up bit y (y=0..15) **/
#define PWR_PUCRB_PU10		(1 << 10)
/** PWR_PUCRB_PU9 Port B pull-up bit y (y=0..15) **/
#define PWR_PUCRB_PU9		(1 << 9)
/** PWR_PUCRB_PU8 Port B pull-up bit y (y=0..15) **/
#define PWR_PUCRB_PU8		(1 << 8)
/** PWR_PUCRB_PU7 Port B pull-up bit y (y=0..15) **/
#define PWR_PUCRB_PU7		(1 << 7)
/** PWR_PUCRB_PU6 Port B pull-up bit y (y=0..15) **/
#define PWR_PUCRB_PU6		(1 << 6)
/** PWR_PUCRB_PU5 Port B pull-up bit y (y=0..15) **/
#define PWR_PUCRB_PU5		(1 << 5)
/** PWR_PUCRB_PU4 Port B pull-up bit y (y=0..15) **/
#define PWR_PUCRB_PU4		(1 << 4)
/** PWR_PUCRB_PU3 Port B pull-up bit y (y=0..15) **/
#define PWR_PUCRB_PU3		(1 << 3)
/** PWR_PUCRB_PU2 Port B pull-up bit y (y=0..15) **/
#define PWR_PUCRB_PU2		(1 << 2)
/** PWR_PUCRB_PU1 Port B pull-up bit y (y=0..15) **/
#define PWR_PUCRB_PU1		(1 << 1)
/** PWR_PUCRB_PU0 Port B pull-up bit y (y=0..15) **/
#define PWR_PUCRB_PU0		(1 << 0)

/**@}*/

/** @defgroup pwr_pdcrb PDCRB Power Port B pull-down control register
@{*/

/** PWR_PDCRB_PD15 Port B pull-down bit y (y=0..15) **/
#define PWR_PDCRB_PD15		(1 << 15)
/** PWR_PDCRB_PD14 Port B pull-down bit y (y=0..15) **/
#define PWR_PDCRB_PD14		(1 << 14)
/** PWR_PDCRB_PD13 Port B pull-down bit y (y=0..15) **/
#define PWR_PDCRB_PD13		(1 << 13)
/** PWR_PDCRB_PD12 Port B pull-down bit y (y=0..15) **/
#define PWR_PDCRB_PD12		(1 << 12)
/** PWR_PDCRB_PD11 Port B pull-down bit y (y=0..15) **/
#define PWR_PDCRB_PD11		(1 << 11)
/** PWR_PDCRB_PD10 Port B pull-down bit y (y=0..15) **/
#define PWR_PDCRB_PD10		(1 << 10)
/** PWR_PDCRB_PD9 Port B pull-down bit y (y=0..15) **/
#define PWR_PDCRB_PD9		(1 << 9)
/** PWR_PDCRB_PD8 Port B pull-down bit y (y=0..15) **/
#define PWR_PDCRB_PD8		(1 << 8)
/** PWR_PDCRB_PD7 Port B pull-down bit y (y=0..15) **/
#define PWR_PDCRB_PD7		(1 << 7)
/** PWR_PDCRB_PD6 Port B pull-down bit y (y=0..15) **/
#define PWR_PDCRB_PD6		(1 << 6)
/** PWR_PDCRB_PD5 Port B pull-down bit y (y=0..15) **/
#define PWR_PDCRB_PD5		(1 << 5)
/** PWR_PDCRB_PD3 Port B pull-down bit y (y=0..15) **/
#define PWR_PDCRB_PD3		(1 << 3)
/** PWR_PDCRB_PD2 Port B pull-down bit y (y=0..15) **/
#define PWR_PDCRB_PD2		(1 << 2)
/** PWR_PDCRB_PD1 Port B pull-down bit y (y=0..15) **/
#define PWR_PDCRB_PD1		(1 << 1)
/** PWR_PDCRB_PD0 Port B pull-down bit y (y=0..15) **/
#define PWR_PDCRB_PD0		(1 << 0)

/**@}*/

/** @defgroup pwr_pucrc PUCRC Power Port C pull-up control register
@{*/

