grevaillot/svd_tools/headers/STM32G441xx/pwr.h
/** PWR_PUCRC_PU15 Port C pull-up bit y (y=0..15) **/
#define PWR_PUCRC_PU15		(1 << 15)
/** PWR_PUCRC_PU14 Port C pull-up bit y (y=0..15) **/
#define PWR_PUCRC_PU14		(1 << 14)
/** PWR_PUCRC_PU13 Port C pull-up bit y (y=0..15) **/
#define PWR_PUCRC_PU13		(1 << 13)
/** PWR_PUCRC_PU12 Port C pull-up bit y (y=0..15) **/
#define PWR_PUCRC_PU12		(1 << 12)
/** PWR_PUCRC_PU11 Port C pull-up bit y (y=0..15) **/
#define PWR_PUCRC_PU11		(1 << 11)
/** PWR_PUCRC_PU10 Port C pull-up bit y (y=0..15) **/
#define PWR_PUCRC_PU10		(1 << 10)
/** PWR_PUCRC_PU9 Port C pull-up bit y (y=0..15) **/
#define PWR_PUCRC_PU9		(1 << 9)
/** PWR_PUCRC_PU8 Port C pull-up bit y (y=0..15) **/
#define PWR_PUCRC_PU8		(1 << 8)
/** PWR_PUCRC_PU7 Port C pull-up bit y (y=0..15) **/
#define PWR_PUCRC_PU7		(1 << 7)
/** PWR_PUCRC_PU6 Port C pull-up bit y (y=0..15) **/
#define PWR_PUCRC_PU6		(1 << 6)
/** PWR_PUCRC_PU5 Port C pull-up bit y (y=0..15) **/
#define PWR_PUCRC_PU5		(1 << 5)
/** PWR_PUCRC_PU4 Port C pull-up bit y (y=0..15) **/
#define PWR_PUCRC_PU4		(1 << 4)
/** PWR_PUCRC_PU3 Port C pull-up bit y (y=0..15) **/
#define PWR_PUCRC_PU3		(1 << 3)
/** PWR_PUCRC_PU2 Port C pull-up bit y (y=0..15) **/
#define PWR_PUCRC_PU2		(1 << 2)
/** PWR_PUCRC_PU1 Port C pull-up bit y (y=0..15) **/
#define PWR_PUCRC_PU1		(1 << 1)
/** PWR_PUCRC_PU0 Port C pull-up bit y (y=0..15) **/
#define PWR_PUCRC_PU0		(1 << 0)

/**@}*/

/** @defgroup pwr_pdcrc PDCRC Power Port C pull-down control register
@{*/

/** PWR_PDCRC_PD15 Port C pull-down bit y (y=0..15) **/
#define PWR_PDCRC_PD15		(1 << 15)
/** PWR_PDCRC_PD14 Port C pull-down bit y (y=0..15) **/
#define PWR_PDCRC_PD14		(1 << 14)
/** PWR_PDCRC_PD13 Port C pull-down bit y (y=0..15) **/
#define PWR_PDCRC_PD13		(1 << 13)
/** PWR_PDCRC_PD12 Port C pull-down bit y (y=0..15) **/
#define PWR_PDCRC_PD12		(1 << 12)
/** PWR_PDCRC_PD11 Port C pull-down bit y (y=0..15) **/
#define PWR_PDCRC_PD11		(1 << 11)
/** PWR_PDCRC_PD10 Port C pull-down bit y (y=0..15) **/
#define PWR_PDCRC_PD10		(1 << 10)
/** PWR_PDCRC_PD9 Port C pull-down bit y (y=0..15) **/
#define PWR_PDCRC_PD9		(1 << 9)
/** PWR_PDCRC_PD8 Port C pull-down bit y (y=0..15) **/
#define PWR_PDCRC_PD8		(1 << 8)
/** PWR_PDCRC_PD7 Port C pull-down bit y (y=0..15) **/
#define PWR_PDCRC_PD7		(1 << 7)
/** PWR_PDCRC_PD6 Port C pull-down bit y (y=0..15) **/
#define PWR_PDCRC_PD6		(1 << 6)
/** PWR_PDCRC_PD5 Port C pull-down bit y (y=0..15) **/
#define PWR_PDCRC_PD5		(1 << 5)
/** PWR_PDCRC_PD4 Port C pull-down bit y (y=0..15) **/
#define PWR_PDCRC_PD4		(1 << 4)
/** PWR_PDCRC_PD3 Port C pull-down bit y (y=0..15) **/
#define PWR_PDCRC_PD3		(1 << 3)
/** PWR_PDCRC_PD2 Port C pull-down bit y (y=0..15) **/
#define PWR_PDCRC_PD2		(1 << 2)
/** PWR_PDCRC_PD1 Port C pull-down bit y (y=0..15) **/
#define PWR_PDCRC_PD1		(1 << 1)
/** PWR_PDCRC_PD0 Port C pull-down bit y (y=0..15) **/
#define PWR_PDCRC_PD0		(1 << 0)

/**@}*/

/** @defgroup pwr_pucrd PUCRD Power Port D pull-up control register
@{*/

/** PWR_PUCRD_PU15 Port D pull-up bit y (y=0..15) **/
#define PWR_PUCRD_PU15		(1 << 15)
/** PWR_PUCRD_PU14 Port D pull-up bit y (y=0..15) **/
#define PWR_PUCRD_PU14		(1 << 14)
/** PWR_PUCRD_PU13 Port D pull-up bit y (y=0..15) **/
#define PWR_PUCRD_PU13		(1 << 13)
/** PWR_PUCRD_PU12 Port D pull-up bit y (y=0..15) **/
#define PWR_PUCRD_PU12		(1 << 12)
/** PWR_PUCRD_PU11 Port D pull-up bit y (y=0..15) **/
#define PWR_PUCRD_PU11		(1 << 11)
/** PWR_PUCRD_PU10 Port D pull-up bit y (y=0..15) **/
#define PWR_PUCRD_PU10		(1 << 10)
/** PWR_PUCRD_PU9 Port D pull-up bit y (y=0..15) **/
#define PWR_PUCRD_PU9		(1 << 9)
/** PWR_PUCRD_PU8 Port D pull-up bit y (y=0..15) **/
#define PWR_PUCRD_PU8		(1 << 8)
/** PWR_PUCRD_PU7 Port D pull-up bit y (y=0..15) **/
#define PWR_PUCRD_PU7		(1 << 7)
/** PWR_PUCRD_PU6 Port D pull-up bit y (y=0..15) **/
#define PWR_PUCRD_PU6		(1 << 6)
/** PWR_PUCRD_PU5 Port D pull-up bit y (y=0..15) **/
#define PWR_PUCRD_PU5		(1 << 5)
/** PWR_PUCRD_PU4 Port D pull-up bit y (y=0..15) **/
#define PWR_PUCRD_PU4		(1 << 4)
/** PWR_PUCRD_PU3 Port D pull-up bit y (y=0..15) **/
#define PWR_PUCRD_PU3		(1 << 3)
/** PWR_PUCRD_PU2 Port D pull-up bit y (y=0..15) **/
#define PWR_PUCRD_PU2		(1 << 2)
/** PWR_PUCRD_PU1 Port D pull-up bit y (y=0..15) **/
#define PWR_PUCRD_PU1		(1 << 1)
/** PWR_PUCRD_PU0 Port D pull-up bit y (y=0..15) **/
#define PWR_PUCRD_PU0		(1 << 0)

/**@}*/

/** @defgroup pwr_pdcrd PDCRD Power Port D pull-down control register
@{*/

/** PWR_PDCRD_PD15 Port D pull-down bit y (y=0..15) **/
#define PWR_PDCRD_PD15		(1 << 15)
/** PWR_PDCRD_PD14 Port D pull-down bit y (y=0..15) **/
#define PWR_PDCRD_PD14		(1 << 14)
/** PWR_PDCRD_PD13 Port D pull-down bit y (y=0..15) **/
#define PWR_PDCRD_PD13		(1 << 13)
/** PWR_PDCRD_PD12 Port D pull-down bit y (y=0..15) **/
#define PWR_PDCRD_PD12		(1 << 12)
/** PWR_PDCRD_PD11 Port D pull-down bit y (y=0..15) **/
#define PWR_PDCRD_PD11		(1 << 11)
/** PWR_PDCRD_PD10 Port D pull-down bit y (y=0..15) **/
#define PWR_PDCRD_PD10		(1 << 10)
/** PWR_PDCRD_PD9 Port D pull-down bit y (y=0..15) **/
#define PWR_PDCRD_PD9		(1 << 9)
/** PWR_PDCRD_PD8 Port D pull-down bit y (y=0..15) **/
#define PWR_PDCRD_PD8		(1 << 8)
/** PWR_PDCRD_PD7 Port D pull-down bit y (y=0..15) **/
#define PWR_PDCRD_PD7		(1 << 7)
/** PWR_PDCRD_PD6 Port D pull-down bit y (y=0..15) **/
#define PWR_PDCRD_PD6		(1 << 6)
/** PWR_PDCRD_PD5 Port D pull-down bit y (y=0..15) **/
#define PWR_PDCRD_PD5		(1 << 5)
/** PWR_PDCRD_PD4 Port D pull-down bit y (y=0..15) **/
#define PWR_PDCRD_PD4		(1 << 4)
/** PWR_PDCRD_PD3 Port D pull-down bit y (y=0..15) **/
#define PWR_PDCRD_PD3		(1 << 3)
/** PWR_PDCRD_PD2 Port D pull-down bit y (y=0..15) **/
#define PWR_PDCRD_PD2		(1 << 2)
/** PWR_PDCRD_PD1 Port D pull-down bit y (y=0..15) **/
#define PWR_PDCRD_PD1		(1 << 1)
/** PWR_PDCRD_PD0 Port D pull-down bit y (y=0..15) **/
#define PWR_PDCRD_PD0		(1 << 0)

/**@}*/

/** @defgroup pwr_pucre PUCRE Power Port E pull-up control register
@{*/

/** PWR_PUCRE_PU15 Port E pull-up bit y (y=0..15) **/
#define PWR_PUCRE_PU15		(1 << 15)
/** PWR_PUCRE_PU14 Port E pull-up bit y (y=0..15) **/
#define PWR_PUCRE_PU14		(1 << 14)
/** PWR_PUCRE_PU13 Port E pull-up bit y (y=0..15) **/
#define PWR_PUCRE_PU13		(1 << 13)
/** PWR_PUCRE_PU12 Port E pull-up bit y (y=0..15) **/
#define PWR_PUCRE_PU12		(1 << 12)
/** PWR_PUCRE_PU11 Port E pull-up bit y (y=0..15) **/
#define PWR_PUCRE_PU11		(1 << 11)
/** PWR_PUCRE_PU10 Port E pull-up bit y (y=0..15) **/
#define PWR_PUCRE_PU10		(1 << 10)
/** PWR_PUCRE_PU9 Port E pull-up bit y (y=0..15) **/
#define PWR_PUCRE_PU9		(1 << 9)
/** PWR_PUCRE_PU8 Port E pull-up bit y (y=0..15) **/
#define PWR_PUCRE_PU8		(1 << 8)
/** PWR_PUCRE_PU7 Port E pull-up bit y (y=0..15) **/
#define PWR_PUCRE_PU7		(1 << 7)
/** PWR_PUCRE_PU6 Port E pull-up bit y (y=0..15) **/
#define PWR_PUCRE_PU6		(1 << 6)
/** PWR_PUCRE_PU5 Port E pull-up bit y (y=0..15) **/
#define PWR_PUCRE_PU5		(1 << 5)
/** PWR_PUCRE_PU4 Port E pull-up bit y (y=0..15) **/
#define PWR_PUCRE_PU4		(1 << 4)
/** PWR_PUCRE_PU3 Port E pull-up bit y (y=0..15) **/
#define PWR_PUCRE_PU3		(1 << 3)
/** PWR_PUCRE_PU2 Port E pull-up bit y (y=0..15) **/
#define PWR_PUCRE_PU2		(1 << 2)
/** PWR_PUCRE_PU1 Port E pull-up bit y (y=0..15) **/
#define PWR_PUCRE_PU1		(1 << 1)
/** PWR_PUCRE_PU0 Port E pull-up bit y (y=0..15) **/
#define PWR_PUCRE_PU0		(1 << 0)

/**@}*/

/** @defgroup pwr_pdcre PDCRE Power Port E pull-down control register
@{*/

/** PWR_PDCRE_PD15 Port E pull-down bit y (y=0..15) **/
#define PWR_PDCRE_PD15		(1 << 15)
/** PWR_PDCRE_PD14 Port E pull-down bit y (y=0..15) **/
#define PWR_PDCRE_PD14		(1 << 14)
/** PWR_PDCRE_PD13 Port E pull-down bit y (y=0..15) **/
#define PWR_PDCRE_PD13		(1 << 13)
/** PWR_PDCRE_PD12 Port E pull-down bit y (y=0..15) **/
#define PWR_PDCRE_PD12		(1 << 12)
/** PWR_PDCRE_PD11 Port E pull-down bit y (y=0..15) **/
#define PWR_PDCRE_PD11		(1 << 11)
/** PWR_PDCRE_PD10 Port E pull-down bit y (y=0..15) **/
#define PWR_PDCRE_PD10		(1 << 10)
/** PWR_PDCRE_PD9 Port E pull-down bit y (y=0..15) **/
#define PWR_PDCRE_PD9		(1 << 9)
/** PWR_PDCRE_PD8 Port E pull-down bit y (y=0..15) **/
#define PWR_PDCRE_PD8		(1 << 8)
/** PWR_PDCRE_PD7 Port E pull-down bit y (y=0..15) **/
#define PWR_PDCRE_PD7		(1 << 7)
/** PWR_PDCRE_PD6 Port E pull-down bit y (y=0..15) **/
#define PWR_PDCRE_PD6		(1 << 6)
/** PWR_PDCRE_PD5 Port E pull-down bit y (y=0..15) **/
#define PWR_PDCRE_PD5		(1 << 5)
/** PWR_PDCRE_PD4 Port E pull-down bit y (y=0..15) **/
#define PWR_PDCRE_PD4		(1 << 4)
/** PWR_PDCRE_PD3 Port E pull-down bit y (y=0..15) **/
#define PWR_PDCRE_PD3		(1 << 3)
/** PWR_PDCRE_PD2 Port E pull-down bit y (y=0..15) **/
#define PWR_PDCRE_PD2		(1 << 2)
/** PWR_PDCRE_PD1 Port E pull-down bit y (y=0..15) **/
#define PWR_PDCRE_PD1		(1 << 1)
/** PWR_PDCRE_PD0 Port E pull-down bit y (y=0..15) **/
#define PWR_PDCRE_PD0		(1 << 0)

/**@}*/

